In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import re

In [ ]:
df = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")

In [ ]:
# Merge data
merged_df = pd.merge(df1, df2, on="MSA Code", how="outer")

In [ ]:
# Save CSV
df.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

# Testing & Filling Gaps

In [15]:
df = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")

In [16]:
df

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
0,10180,"Abilene, TX",48,0.063769,336.73,184278,3.5
1,10380,"Aguadilla, PR",72,NaN,NaN,250969,7.6
2,10420,"Akron, OH",39,0.042533,257.62,702209,4.4
3,10500,"Albany, GA",13,0.042710,241.76,145451,4.2
4,10540,"Albany, OR",41,0.059973,420.17,132474,4.6
...,...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523,6.1
389,49620,"York Hanover, PA",42,0.033496,298.40,471240,3.4
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086,5.0
391,49700,"Yuba City, CA",6,0.063023,373.30,186014,7.8
392,49740,"Yuma, AZ",4,0.056883,328.40,220310,12.2

In [17]:
df_with_nan = df[df.isna().any(axis=1)]
df_with_nan

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
1,10380,"Aguadilla, PR",72,NaN,NaN,250969,7.6
17,11640,"Arecibo, PR",72,NaN,NaN,180071,6.2
20,12060,"Atlanta Sandy Springs Roswell, GA",13,NaN,NaN,6411149,3.4
44,14460,"Boston Cambridge Newton, MA NH",25,NaN,NaN,5025517,3.7
69,16980,"Chicago Naperville Elgin, IL IN",17,NaN,NaN,9408576,5.1
86,19100,"Dallas Fort Worth Arlington, TX",48,NaN,NaN,8344032,3.9
96,19820,"Detroit Warren Dearborn, MI",26,NaN,NaN,4400578,4.5
102,20580,"Eagle Pass, TX",48,NaN,NaN,58829,7.9
144,25020,"Guayama, PR",72,NaN,NaN,64546,8.9
214,31080,"Los Angeles Long Beach Anaheim, CA",6,NaN,NaN,12927614,5.4
224,32420,"Mayagüez, PR",72,NaN,NaN,207205,6.3
229,33100,"Miami Fort Lauderdale West Palm Beach, FL",12,NaN,NaN,6457988,2.9
253,35620,"New York Newark Jersey City, NY NJ",34,NaN,NaN,19940274,4.5
273,37980,"Philadelphia Camden Wilmington, PA NJ DE MD",10,NaN,NaN,6330422,3.8
279,38660,"Ponce, PR",72,NaN,NaN,265039,8.2
316,41860,"San Francisco Oakland Fremont, CA",6,NaN,NaN,4648486,4.2
318,41980,"San Juan Bayamón Caguas, PR",72,NaN,NaN,2035484,4.8
326,42660,"Seattle Tacoma Bellevue, WA",53,NaN,NaN,4145494,4.2
349,45300,"Tampa St. Petersburg Clearwater, FL",12,NaN,NaN,3424560,3.5
372,47900,"Washington Arlington Alexandria, DC VA MD WV",11,NaN,NaN,6436489,3.0

In [18]:
df['HPI Volatility'] = df['HPI Volatility'] * 100

In [19]:
df.at[1, 'Most Recent HPI'] = 250
df.at[17, 'Most Recent HPI'] = 240
df.at[20, 'Most Recent HPI'] = 436.5
df.at[44, 'Most Recent HPI'] = 333.8
df.at[69, 'Most Recent HPI'] = 192.8
df.at[86, 'Most Recent HPI'] = 295.7
df.at[96, 'Most Recent HPI'] = 194.8
df.at[102, 'Most Recent HPI'] = 215
df.at[144, 'Most Recent HPI'] = 230
df.at[214, 'Most Recent HPI'] = 398.4
df.at[224, 'Most Recent HPI'] = 245
df.at[229, 'Most Recent HPI'] = 584
df.at[253, 'Most Recent HPI'] = 398
df.at[273, 'Most Recent HPI'] = 401.7
df.at[279, 'Most Recent HPI'] = 245
df.at[316, 'Most Recent HPI'] = 505.9
df.at[318, 'Most Recent HPI'] = 255
df.at[326, 'Most Recent HPI'] = 554
df.at[349, 'Most Recent HPI'] = 554.5
df.at[372, 'Most Recent HPI'] = 392.5

In [20]:
df.at[1, 'HPI Volatility'] = 6.5
df.at[17, 'HPI Volatility'] = 6.2
df.at[20, 'HPI Volatility'] = 4.2
df.at[44, 'HPI Volatility'] = 4.4
df.at[69, 'HPI Volatility'] = 3.2
df.at[86, 'HPI Volatility'] = 4.0
df.at[96, 'HPI Volatility'] = 4.5
df.at[102, 'HPI Volatility'] = 4.8
df.at[144, 'HPI Volatility'] = 6.8
df.at[214, 'HPI Volatility'] = 5.3
df.at[224, 'HPI Volatility'] = 6.3
df.at[229, 'HPI Volatility'] = 6.5
df.at[253, 'HPI Volatility'] = 4.0
df.at[273, 'HPI Volatility'] = 3.8
df.at[279, 'HPI Volatility'] = 8.0
df.at[316, 'HPI Volatility'] = 4.5
df.at[318, 'HPI Volatility'] = 5.1
df.at[326, 'HPI Volatility'] = 4.2
df.at[349, 'HPI Volatility'] = 4.3
df.at[372, 'HPI Volatility'] = 3.7

In [21]:
df

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
0,10180,"Abilene, TX",48,6.376873,336.73,184278,3.5
1,10380,"Aguadilla, PR",72,6.500000,250.00,250969,7.6
2,10420,"Akron, OH",39,4.253307,257.62,702209,4.4
3,10500,"Albany, GA",13,4.271005,241.76,145451,4.2
4,10540,"Albany, OR",41,5.997320,420.17,132474,4.6
...,...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,4.223467,344.07,258523,6.1
389,49620,"York Hanover, PA",42,3.349559,298.40,471240,3.4
390,49660,"Youngstown Warren, OH",39,3.292840,268.70,426086,5.0
391,49700,"Yuba City, CA",6,6.302289,373.30,186014,7.8
392,49740,"Yuma, AZ",4,5.688339,328.40,220310,12.2

In [22]:
df.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

# Unemployment Rates

In [26]:
df = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Unemployment Rates.csv")

In [27]:
df = df[~df['MSA Name'].isna() & (df['MSA Name'] != 'End of table.')]
df.reset_index(drop=True, inplace=True)

In [28]:
# Rename the 2024 column
df = df.rename(columns={"2024": "Unemployment Rate"})

# Keep only the 'MSA Name' and 'Unemployment Rate' columns
df = df[["MSA Name", "Unemployment Rate"]]

In [29]:
def standardize_msa(name):
    return name.replace("-", " ").strip()

In [30]:
df['MSA Name'] = df['MSA Name'].apply(standardize_msa)

In [31]:
df

                      MSA Name  Unemployment Rate
0          Anniston Oxford, AL                3.2
1           Auburn Opelika, AL                3.0
2               Birmingham, AL                2.9
3    Daphne Fairhope Foley, AL                2.7
4                  Decatur, AL                2.6
..                         ...                ...
382  Racine Mount Pleasant, WI                3.5
383              Sheboygan, WI                2.5
384                 Wausau, WI                2.6
385                 Casper, WY                3.3
386               Cheyenne, WY                3.4

[387 rows x 2 columns]

In [32]:
df3 = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")
df3['MSA Code'] = df3['MSA Code'].astype(str).str.strip()

In [33]:
df3

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population
0,10180,"Abilene, TX",48,0.063769,336.73,184278
1,10380,"Aguadilla, PR",72,NaN,NaN,250969
2,10420,"Akron, OH",39,0.042533,257.62,702209
3,10500,"Albany, GA",13,0.042710,241.76,145451
4,10540,"Albany, OR",41,0.059973,420.17,132474
...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523
389,49620,"York Hanover, PA",42,0.033496,298.40,471240
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086
391,49700,"Yuba City, CA",6,0.063023,373.30,186014
392,49740,"Yuma, AZ",4,0.056883,328.40,220310

In [34]:
merged = df3.merge(df, on='MSA Name', how='left')

In [35]:
merged

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
0,10180,"Abilene, TX",48,0.063769,336.73,184278,3.5
1,10380,"Aguadilla, PR",72,NaN,NaN,250969,NaN
2,10420,"Akron, OH",39,0.042533,257.62,702209,4.4
3,10500,"Albany, GA",13,0.042710,241.76,145451,4.2
4,10540,"Albany, OR",41,0.059973,420.17,132474,4.6
...,...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523,6.1
389,49620,"York Hanover, PA",42,0.033496,298.40,471240,3.4
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086,5.0
391,49700,"Yuba City, CA",6,0.063023,373.30,186014,7.8
392,49740,"Yuma, AZ",4,0.056883,328.40,220310,12.2

In [ ]:
# GPT found these missing ones online somewhere

merged.loc[1, 'Unemployment Rate'] = 7.6
merged.loc[17, 'Unemployment Rate'] = 6.2
merged.loc[144, 'Unemployment Rate'] = 8.9
merged.loc[224, 'Unemployment Rate'] = 6.3
merged.loc[279, 'Unemployment Rate'] = 8.2
merged.loc[307, 'Unemployment Rate'] = 3.7
merged.loc[318, 'Unemployment Rate'] = 4.8

In [37]:
merged

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
0,10180,"Abilene, TX",48,0.063769,336.73,184278,3.5
1,10380,"Aguadilla, PR",72,NaN,NaN,250969,7.6
2,10420,"Akron, OH",39,0.042533,257.62,702209,4.4
3,10500,"Albany, GA",13,0.042710,241.76,145451,4.2
4,10540,"Albany, OR",41,0.059973,420.17,132474,4.6
...,...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523,6.1
389,49620,"York Hanover, PA",42,0.033496,298.40,471240,3.4
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086,5.0
391,49700,"Yuba City, CA",6,0.063023,373.30,186014,7.8
392,49740,"Yuma, AZ",4,0.056883,328.40,220310,12.2

In [39]:
merged['Unemployment Rate'] = merged['Unemployment Rate'].astype(float)

In [40]:
merged

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population,Unemployment Rate
0,10180,"Abilene, TX",48,0.063769,336.73,184278,3.5
1,10380,"Aguadilla, PR",72,NaN,NaN,250969,7.6
2,10420,"Akron, OH",39,0.042533,257.62,702209,4.4
3,10500,"Albany, GA",13,0.042710,241.76,145451,4.2
4,10540,"Albany, OR",41,0.059973,420.17,132474,4.6
...,...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523,6.1
389,49620,"York Hanover, PA",42,0.033496,298.40,471240,3.4
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086,5.0
391,49700,"Yuba City, CA",6,0.063023,373.30,186014,7.8
392,49740,"Yuma, AZ",4,0.056883,328.40,220310,12.2

In [41]:
merged.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

# Population

In [2]:
df = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Population Data.csv")

In [4]:
df['MSA Name'] = df['MSA Name'].apply(lambda x: x.lstrip('.') if isinstance(x, str) and x.startswith('.') else x)

In [6]:
df = df.rename(columns={"2024": "Population"})

# Step 2: Drop other year columns
df = df.drop(columns=["2020", "2021", "2022", "2023"])

# Step 3: Ensure Population column is int
df["Population"] = df["Population"].astype(int)

In [ ]:
df

In [14]:
df['MSA Name'] = df['MSA Name'].str.replace(' Metro Area', '', regex=False)

In [3]:
df3 = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")
df3['MSA Code'] = df3['MSA Code'].astype(str).str.strip()

In [4]:
df3

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population
0,10180,"Abilene, TX",48,0.063769,336.73,184278
1,10380,"Aguadilla, PR",72,NaN,NaN,250969
2,10420,"Akron, OH",39,0.042533,257.62,702209
3,10500,"Albany, GA",13,0.042710,241.76,145451
4,10540,"Albany, OR",41,0.059973,420.17,132474
...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523
389,49620,"York Hanover, PA",42,0.033496,298.40,471240
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086
391,49700,"Yuba City, CA",6,0.063023,373.30,186014
392,49740,"Yuma, AZ",4,0.056883,328.40,220310

In [27]:
merged = df3.merge(df, on='MSA Name', how='left')

In [28]:
merged

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI,Population
0,10180,"Abilene, TX",48,0.063769,336.73,184278
1,10380,"Aguadilla, PR",72,NaN,NaN,250969
2,10420,"Akron, OH",39,0.042533,257.62,702209
3,10500,"Albany, GA",13,0.042710,241.76,145451
4,10540,"Albany, OR",41,0.059973,420.17,132474
...,...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07,258523
389,49620,"York Hanover, PA",42,0.033496,298.40,471240
390,49660,"Youngstown Warren, OH",39,0.032928,268.70,426086
391,49700,"Yuba City, CA",6,0.063023,373.30,186014
392,49740,"Yuma, AZ",4,0.056883,328.40,220310

In [30]:
merged.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

In [29]:
df['Population'].isna().any()

np.False_

In [25]:
df.tail()

                        MSA Name  Population
388                  Arecibo, PR      180071
389                  Guayama, PR       64546
390                 Mayagüez, PR      207205
391                    Ponce, PR      265039
392  San Juan Bayamón Caguas, PR     2035484

In [23]:
df4.tail()

      MSA Code               MSA Name  FIPS State Code
1284     49420             Yakima, WA               53
1286     49620       York Hanover, PA               42
1288     49660  Youngstown Warren, OH               39
1290     49700          Yuba City, CA                6
1291     49740               Yuma, AZ                4

In [8]:
def standardize_msa(name):
    return name.replace("-", " ").strip()

In [9]:
df['MSA Name'] = df['MSA Name'].apply(standardize_msa)

In [10]:
df4 = pd.read_csv(r'C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Naming Conventions.csv')

df4 = df4[df4["Metropolitan/Micropolitan Statistical Area"] == "Metropolitan Statistical Area"]
df4 = df4[["CBSA Code", "CBSA Title", "FIPS State Code"]]
df4 = df4.drop_duplicates(subset="CBSA Code", keep="first")

df4 = df4.drop_duplicates(subset='CBSA Code', keep='first')
df4 = df4.drop_duplicates(subset='CBSA Title', keep='first')

df4 = df4.rename(columns={'CBSA Code': 'MSA Code', 'CBSA Title': 'MSA Name'})

df4['MSA Name'] = df4['MSA Name'].apply(standardize_msa)

In [17]:
merged = df4.merge(df, on='MSA Name', how='left')

In [22]:
merged.tail(50)

,MSA Code,MSA Name,FIPS State Code,Population
343,44300,"State College, PA",42,159805
344,44420,"Staunton Stuarts Draft, VA",51,128481
345,44700,"Stockton Lodi, CA",6,816108
346,44940,"Sumter, SC",45,104776
347,45060,"Syracuse, NY",36,655189
348,45220,"Tallahassee, FL",12,397675
349,45300,"Tampa St. Petersburg Clearwater, FL",12,3424560
350,45460,"Terre Haute, IN",18,168874
351,45500,"Texarkana, TX AR",48,145576
352,45780,"Toledo, OH",39,601396
353,45820,"Topeka, KS",20,232648
354,45900,"Traverse City, MI",26,156634
355,45940,"Trenton Princeton, NJ",34,392138
356,46060,"Tucson, AZ",4,1080149
357,46140,"Tulsa, OK",40,1059803
358,46220,"Tuscaloosa, AL",1,281963
359,46300,"Twin Falls, ID",16,122565
360,46340,"Tyler, TX",48,249091
361,46520,"Urban Honolulu, HI",15,998747
362,46540,"Utica Rome, NY",36,287932
363,46660,"Valdosta, GA",13,152588
364,46700,"Vallejo, CA",6,455101
365,47020,"Victoria, TX",48,99170
366,47220,"Vineland, NJ",34,155678
367,47260,"Virginia Beach Chesapeake Norfolk, VA NC",51,1794278
368,47300,"Visalia, CA",6,483546
369,47380,"Waco, TX",48,307123
370,47460,"Walla Walla, WA",53,62068
371,47580,"Warner Robins, GA",13,204110
372,47900,"Washington Arlington Alexandria, DC VA MD WV",11,6436489
373,47930,"Waterbury Shelton, CT",9,462220
374,47940,"Waterloo Cedar Falls, IA",19,170081
375,48060,"Watertown Fort Drum, NY",36,113140
376,48140,"Wausau, WI",55,139091
377,48260,"Weirton Steubenville, WV OH",39,113239
378,48300,"Wenatchee East Wenatchee, WA",53,127023
379,48540,"Wheeling, WV OH",54,135136
380,48620,"Wichita, KS",20,661217
381,48660,"Wichita Falls, TX",48,149869
382,48680,"Wildwood The Villages, FL",12,154693
383,48700,"Williamsport, PA",42,113236
384,48900,"Wilmington, NC",37,480522
385,49020,"Winchester, VA WV",51,149702
386,49180,"Winston Salem, NC",37,705187
387,49340,"Worcester, MA",25,881248
388,49420,"Yakima, WA",53,258523
389,49620,"York Hanover, PA",42,471240
390,49660,"Youngstown Warren, OH",39,426086
391,49700,"Yuba City, CA",6,186014
392,49740,"Yuma, AZ",4,220310

# HPI Raw

In [15]:
df = pd.read_csv(r'C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA_HPI (All transactions, not seasonally adjusted).csv', header=None)
df.columns = ['MSA Name', 'MSA Code', 'Year', 'Quarter', 'HPI', 'Unknown']

df['HPI'] = pd.to_numeric(df['HPI'], errors='coerce')
df['MSA Code'] = pd.to_numeric(df['MSA Code'], errors='coerce')

quarter_to_month = {1: 1, 2: 4, 3: 7, 4: 10}
df['Month'] = df['Quarter'].map(quarter_to_month)
df['Date'] = pd.to_datetime(dict(year=df['Year'], month=df['Month'], day=1))

In [16]:
df

          MSA Name  MSA Code  Year  Quarter     HPI Unknown  Month       Date
0      Abilene, TX     10180  1975        1     NaN       -      1 1975-01-01
1      Abilene, TX     10180  1975        2     NaN       -      4 1975-04-01
2      Abilene, TX     10180  1975        3     NaN       -      7 1975-07-01
3      Abilene, TX     10180  1975        4     NaN       -     10 1975-10-01
4      Abilene, TX     10180  1976        1     NaN       -      1 1976-01-01
...            ...       ...   ...      ...     ...     ...    ...        ...
82405     Yuma, AZ     49740  2024        1  325.62    -6.5      1 2024-01-01
82406     Yuma, AZ     49740  2024        2  326.98   -6.41      4 2024-04-01
82407     Yuma, AZ     49740  2024        3  340.22   -7.05      7 2024-07-01
82408     Yuma, AZ     49740  2024        4  339.21    -6.3     10 2024-10-01
82409     Yuma, AZ     49740  2025        1  328.40   -7.19      1 2025-01-01

[82410 rows x 8 columns]

In [17]:
df[df['MSA Code'] == 49660]

,MSA Name,MSA Code,Year,Quarter,HPI,Unknown,Month,Date
81807,"Youngstown-Warren, OH",49660,1975,1,NaN,-,1,1975-01-01
81808,"Youngstown-Warren, OH",49660,1975,2,NaN,-,4,1975-04-01
81809,"Youngstown-Warren, OH",49660,1975,3,NaN,-,7,1975-07-01
81810,"Youngstown-Warren, OH",49660,1975,4,NaN,-,10,1975-10-01
81811,"Youngstown-Warren, OH",49660,1976,1,NaN,-,1,1976-01-01
...,...,...,...,...,...,...,...,...
82003,"Youngstown-Warren, OH",49660,2024,1,244.62,-3.43,1,2024-01-01
82004,"Youngstown-Warren, OH",49660,2024,2,257.92,-3.62,4,2024-04-01
82005,"Youngstown-Warren, OH",49660,2024,3,261.98,-3.69,7,2024-07-01
82006,"Youngstown-Warren, OH",49660,2024,4,261.94,-3.63,10,2024-10-01
82007,"Youngstown-Warren, OH",49660,2025,1,268.70,-4.47,1,2025-01-01

In [18]:
non_null_df = df[df["HPI"].notnull()]

# Step 2: Sort by Date so latest is last (you could also sort descending and pick first)
non_null_df = non_null_df.sort_values(by=["MSA Code", "Date"])

# Step 3: Get the most recent (last) non-null HPI per MSA Code
recent_hpi = non_null_df.groupby("MSA Code").tail(1)

# Step 4: Create new DataFrame with MSA Code and most recent HPI
result_df = recent_hpi[["MSA Code", "HPI"]].rename(columns={"HPI": "Most Recent HPI"})

# Step 5: To include MSA Codes with all null HPI:
all_codes = df[["MSA Code"]].drop_duplicates()
final_df = all_codes.merge(result_df, on="MSA Code", how="left")

In [19]:
df3 = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")
df3['MSA Code'] = df3['MSA Code'].astype(str).str.strip()

In [20]:
df3["MSA Code"] = df3["MSA Code"].astype(str)
final_df["MSA Code"] = final_df["MSA Code"].astype(str)
merged = df3.merge(final_df, on='MSA Code', how='left')

In [23]:
merged

,MSA Code,MSA Name,FIPS State Code,HPI Volatility,Most Recent HPI
0,10180,"Abilene, TX",48,0.063769,336.73
1,10380,"Aguadilla, PR",72,NaN,NaN
2,10420,"Akron, OH",39,0.042533,257.62
3,10500,"Albany, GA",13,0.042710,241.76
4,10540,"Albany, OR",41,0.059973,420.17
...,...,...,...,...,...
388,49420,"Yakima, WA",53,0.042235,344.07
389,49620,"York Hanover, PA",42,0.033496,298.40
390,49660,"Youngstown Warren, OH",39,0.032928,268.70
391,49700,"Yuba City, CA",6,0.063023,373.30
392,49740,"Yuma, AZ",4,0.056883,328.40

In [24]:
merged.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

# Names & Codes

In [4]:
def standardize_msa(name):
    return name.replace("-", " ").strip()

In [5]:
df = pd.read_csv(r'C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Naming Conventions.csv')

df = df[df["Metropolitan/Micropolitan Statistical Area"] == "Metropolitan Statistical Area"]
df = df[["CBSA Code", "CBSA Title", "FIPS State Code"]]
df = df.drop_duplicates(subset="CBSA Code", keep="first")

df = df.drop_duplicates(subset='CBSA Code', keep='first')
df = df.drop_duplicates(subset='CBSA Title', keep='first')

df = df.rename(columns={'CBSA Code': 'MSA Code', 'CBSA Title': 'MSA Name'})

df['MSA Name'] = df['MSA Name'].apply(standardize_msa)

In [ ]:
df

      MSA Code               MSA Name  FIPS State Code
2        10180            Abilene, TX               48
5        10380          Aguadilla, PR               72
6        10420              Akron, OH               39
9        10500             Albany, GA               13
10       10540             Albany, OR               41
...        ...                    ...              ...
1284     49420             Yakima, WA               53
1286     49620       York Hanover, PA               42
1288     49660  Youngstown Warren, OH               39
1290     49700          Yuba City, CA                6
1291     49740               Yuma, AZ                4

[393 rows x 3 columns]

# HPI Data

In [18]:
df = pd.read_csv(r'C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA_HPI (All transactions, not seasonally adjusted).csv', header=None)
df.columns = ['MSA Name', 'MSA Code', 'Year', 'Quarter', 'HPI', 'Unknown']

In [19]:
df['HPI'] = pd.to_numeric(df['HPI'], errors='coerce')
df['MSA Code'] = pd.to_numeric(df['MSA Code'], errors='coerce')

In [20]:
quarter_to_month = {1: 1, 2: 4, 3: 7, 4: 10}
df['Month'] = df['Quarter'].map(quarter_to_month)
df['Date'] = pd.to_datetime(dict(year=df['Year'], month=df['Month'], day=1))

In [21]:
df.head()

      MSA Name  MSA Code  Year  Quarter  HPI Unknown  Month       Date
0  Abilene, TX     10180  1975        1  NaN       -      1 1975-01-01
1  Abilene, TX     10180  1975        2  NaN       -      4 1975-04-01
2  Abilene, TX     10180  1975        3  NaN       -      7 1975-07-01
3  Abilene, TX     10180  1975        4  NaN       -     10 1975-10-01
4  Abilene, TX     10180  1976        1  NaN       -      1 1976-01-01

In [22]:
def hpi_vol(df, date_col="Date", hpi_col="HPI", annualise=True):
    """
    Quarterly HPI volatility (sample stdev of simple returns).

    Parameters
    ----------
    df           : DataFrame with at least `date_col` and `hpi_col`
    date_col     : name of the date column (used only for sorting)
    hpi_col      : name of the HPI level column
    annualise    : multiply by √4 to express as annual volatility

    Returns
    -------
    float
    """
    # 1. Put rows in time order, grab the HPI level
    hpi = df.sort_values(date_col)[hpi_col].astype(float)

    # 2. Turn levels into simple %-change quarterly returns
    #q_ret = hpi.pct_change().dropna()
    q_ret = hpi.pct_change(fill_method=None).dropna()

    # 3. Sample standard deviation of those returns
    vol = q_ret.std(ddof=1)

    # 4. Scale up to annual if desired
    return vol * np.sqrt(4) if annualise else vol

In [23]:
results = {}
vols = []
for code in df['MSA Code'].unique():
    df_msa = df[df['MSA Code'] == code]
    result = hpi_vol(df_msa)
    results[code] = result
    vols.append(result)
print(results)

{np.int64(10180): np.float64(0.06376872742869745), np.int64(10420): np.float64(0.04253307109305292), np.int64(10500): np.float64(0.04271005046652267), np.int64(10540): np.float64(0.0599732006758326), np.int64(10580): np.float64(0.052775493398816944), np.int64(10740): np.float64(0.05180681000625275), np.int64(10780): np.float64(0.04526169226530151), np.int64(10900): np.float64(0.05637992995635747), np.int64(11020): np.float64(0.0460443484934806), np.int64(11100): np.float64(0.06152049180403236), np.int64(11180): np.float64(0.036975735449655385), np.int64(11200): np.float64(0.04652763294848104), np.int64(11244): np.float64(0.06347948884961448), np.int64(11260): np.float64(0.06966733035996613), np.int64(11460): np.float64(0.04636365511954396), np.int64(11500): np.float64(0.04690062146935807), np.int64(11540): np.float64(0.026487453226272616), np.int64(11694): np.float64(0.053540242268870754), np.int64(11700): np.float64(0.035896985465150556), np.int64(12020): np.float64(0.03526033456122403), np.int64(12054): np.float64(0.037781566645830766), np.int64(12100): np.float64(0.07132378686956631), np.int64(12220): np.float64(0.043861287996481396), np.int64(12260): np.float64(0.05553623278073345), np.int64(12420): np.float64(0.07375544847661213), np.int64(12540): np.float64(0.06214114380869493), np.int64(12580): np.float64(0.037400817206275416), np.int64(12620): np.float64(0.053524932296552065), np.int64(12700): np.float64(0.05102887990443714), np.int64(12940): np.float64(0.03297207523291908), np.int64(12980): np.float64(0.04426585272242593), np.int64(13020): np.float64(0.05065535160980586), np.int64(13140): np.float64(0.07360625090785998), np.int64(13220): np.float64(0.06091787904691096), np.int64(13380): np.float64(0.0494912481375489), np.int64(13460): np.float64(0.058047710022596476), np.int64(13740): np.float64(0.04846355483471941), np.int64(13780): np.float64(0.054717525241826784), np.int64(13820): np.float64(0.04241269249245562), np.int64(13900): np.float64(0.02883046442138957), np.int64(13980): np.float64(0.03695300591584911), np.int64(14010): np.float64(0.02914878161313596), np.int64(14020): np.float64(0.034351797457660586), np.int64(14260): np.float64(0.07277256637843857), np.int64(14454): np.float64(0.04714284459273617), np.int64(14500): np.float64(0.04990812208613776), np.int64(14540): np.float64(0.03374551906320753), np.int64(14580): np.float64(0.05017344318570817), np.int64(14740): np.float64(0.051105475666261176), np.int64(14860): np.float64(0.05033827734814178), np.int64(15180): np.float64(0.0526150398929134), np.int64(15260): np.float64(0.05322529847826757), np.int64(15380): np.float64(0.04389432144592434), np.int64(15500): np.float64(0.03999370660399787), np.int64(15540): np.float64(0.034620080828461804), np.int64(15764): np.float64(0.04563847796204715), np.int64(15804): np.float64(0.048390690567948896), np.int64(15940): np.float64(0.041383134029900674), np.int64(15980): np.float64(0.07686299416643634), np.int64(16020): np.float64(0.039880919408950666), np.int64(16180): np.float64(0.0637842194801868), np.int64(16220): np.float64(0.0781594902175824), np.int64(16300): np.float64(0.03889893331840693), np.int64(16540): np.float64(0.04455152217067298), np.int64(16580): np.float64(0.032996725168655074), np.int64(16620): np.float64(0.04554245473834947), np.int64(16700): np.float64(0.08916922609659556), np.int64(16740): np.float64(0.042209939241919875), np.int64(16820): np.float64(0.04245509239336861), np.int64(16860): np.float64(0.06346302091060255), np.int64(16940): np.float64(0.05744724521829462), np.int64(16984): np.float64(0.04464408798227395), np.int64(17020): np.float64(0.0623444683727429), np.int64(17140): np.float64(0.029631446073404392), np.int64(17300): np.float64(0.03421273109559707), np.int64(17410): np.float64(0.04776498659699582), np.int64(17420): np.float64(0.040177836970868686), np.int64(17660): np.float64(0.057012894449250784), np.int64(17780): np.float64(0.042382917158560005), np.int64(17820): np.float64(0.07029026743174611), np.int64(17860): np.float64(0.04275263951520415), np.int64(17900): np.float64(0.03301992746511042), np.int64(17980): np.float64(0.035866119906799415), np.int64(18020): np.float64(0.03201564446068502), np.int64(18140): np.float64(0.032615100363711055), np.int64(18580): np.float64(0.059586253353211646), np.int64(18700): np.float64(0.047922218821451534), np.int64(18880): np.float64(0.05500492244905947), np.int64(19124): np.float64(0.0549500120094024), np.int64(19140): np.float64(0.05611192022201265), np.int64(19300): np.float64(0.04389025037891843), np.int64(19340): np.float64(0.044367438721230605), np.int64(19430): np.float64(0.04157383923813032), np.int64(19460): np.float64(0.037853264144594834), np.int64(19500): np.float64(0.03735714075820305), np.int64(19660): np.float64(0.06690694751064118), np.int64(19740): np.float64(0.03866918741304073), np.int64(19780): np.float64(0.05205400727599236), np.int64(19804): np.float64(0.04869300535513531), np.int64(20020): np.float64(0.043527461397290065), np.int64(20100): np.float64(0.04421829451917766), np.int64(20220): np.float64(0.032228727814716106), np.int64(20260): np.float64(0.03457994149136429), np.int64(20500): np.float64(0.04714736679204153), np.int64(20740): np.float64(0.042076130748519035), np.int64(20940): np.float64(0.06548707247658725), np.int64(20994): np.float64(0.09469870203040834), np.int64(21060): np.float64(0.041705396672225975), np.int64(21140): np.float64(0.03654578624420131), np.int64(21300): np.float64(0.06699229779598227), np.int64(21340): np.float64(0.04210282374147677), np.int64(21420): np.float64(0.08850257694991619), np.int64(21500): np.float64(0.04181164883716178), np.int64(21660): np.float64(0.08352284052911199), np.int64(21780): np.float64(0.034156924070633934), np.int64(21794): np.float64(0.05665209081820988), np.int64(21820): np.float64(0.08913124619828067), np.int64(22020): np.float64(0.03292873928184749), np.int64(22140): np.float64(0.061907127222821), np.int64(22180): np.float64(0.03858546078526746), np.int64(22220): np.float64(0.07343945912140805), np.int64(22380): np.float64(0.05489413222040426), np.int64(22420): np.float64(0.08024173856656051), np.int64(22500): np.float64(0.03709175260031182), np.int64(22520): np.float64(0.04201827367342355), np.int64(22540): np.float64(0.04068593204334457), np.int64(22660): np.float64(0.05818443543954118), np.int64(22744): np.float64(0.11058851618828154), np.int64(22900): np.float64(0.04651910057730804), np.int64(23060): np.float64(0.06460231944639339), np.int64(23104): np.float64(0.04913709811217896), np.int64(23224): np.float64(0.046773815655417925), np.int64(23420): np.float64(0.05887948367801787), np.int64(23460): np.float64(0.042962030913937126), np.int64(23540): np.float64(0.07433125805450849), np.int64(23580): np.float64(0.04737305119416587), np.int64(23900): np.float64(0.04349083900712163), np.int64(24020): np.float64(0.05980632986925881), np.int64(24140): np.float64(0.053102774444960886), np.int64(24220): np.float64(0.03760834006930146), np.int64(24260): np.float64(0.042397390733837755), np.int64(24300): np.float64(0.08716518872397483), np.int64(24340): np.float64(0.037716004618835036), np.int64(24420): np.float64(0.05399105812993871), np.int64(24500): np.float64(0.04483265039795412), np.int64(24540): np.float64(0.05425125481740924), np.int64(24580): np.float64(0.02831936287657677), np.int64(24660): np.float64(0.03641061328454231), np.int64(24780): np.float64(0.04297958067316829), np.int64(24860): np.float64(0.05855493379534754), np.int64(25060): np.float64(0.04952381525335165), np.int64(25180): np.float64(0.047290593981927455), np.int64(25220): np.float64(0.05603731906197981), np.int64(25260): np.float64(0.05519045596505229), np.int64(25420): np.float64(0.03132622143319454), np.int64(25500): np.float64(0.04268066806938993), np.int64(25540): np.float64(0.05109127472909288), np.int64(25620): np.float64(0.04766957915032474), np.int64(25740): np.float64(0.042796038894586164), np.int64(25860): np.float64(0.038631926454026244), np.int64(25940): np.float64(0.05020410694186347), np.int64(25980): np.float64(0.0949769392334753), np.int64(26140): np.float64(0.09852297568816734), np.int64(26300): np.float64(0.05063513495613843), np.int64(26380): np.float64(0.04497103199113383), np.int64(26420): np.float64(0.04204703367332918), np.int64(26580): np.float64(0.03772022485988417), np.int64(26620): np.float64(0.030982691273637078), np.int64(26820): np.float64(0.04689536728342045), np.int64(26900): np.float64(0.032718829294387686), np.int64(26980): np.float64(0.032931323412655235), np.int64(27060): np.float64(0.05953770263990535), np.int64(27100): np.float64(0.0543488210026822), np.int64(27140): np.float64(0.07110524401955497), np.int64(27180): np.float64(0.03832048261302218), np.int64(27260): np.float64(0.04708321960802148), np.int64(27340): np.float64(0.058009891117472366), np.int64(27500): np.float64(0.040233225617506536), np.int64(27620): np.float64(0.03404187971303584), np.int64(27740): np.float64(0.0402876699633476), np.int64(27780): np.float64(0.06555408705520512), np.int64(27860): np.float64(0.03578862575938601), np.int64(27900): np.float64(0.0398783715935877), np.int64(27980): np.float64(0.06870736558795858), np.int64(28020): np.float64(0.04175180902445959), np.int64(28100): np.float64(0.040193221954803626), np.int64(28140): np.float64(0.03189260699465469), np.int64(28420): np.float64(0.07395791381905684), np.int64(28450): np.float64(0.03703776012842408), np.int64(28660): np.float64(0.050898803311331536), np.int64(28700): np.float64(0.04024855310869405), np.int64(28740): np.float64(0.05615031169475108), np.int64(28880): np.float64(0.054256336732041596), np.int64(28940): np.float64(0.03329103647366083), np.int64(29020): np.float64(0.04478087858212188), np.int64(29100): np.float64(0.03405264884039477), np.int64(29180): np.float64(0.04681800658471781), np.int64(29200): np.float64(0.031534363117252454), np.int64(29340): np.float64(0.040293895444558955), np.int64(29404): np.float64(0.046351160314091915), np.int64(29414): np.float64(0.036002726223538235), np.int64(29420): np.float64(0.0587763775944033), np.int64(29460): np.float64(0.06300941978377364), np.int64(29484): np.float64(0.043815125436682555), np.int64(29540): np.float64(0.05054234571201504), np.int64(29620): np.float64(0.05515553037108068), np.int64(29700): np.float64(0.06884424982561342), np.int64(29740): np.float64(0.03999555420377085), np.int64(29820): np.float64(0.08613010265825254), np.int64(29940): np.float64(0.040943824968195555), np.int64(30020): np.float64(0.06290278002001039), np.int64(30140): np.float64(0.040140348458379285), np.int64(30300): np.float64(0.047138286459257724), np.int64(30340): np.float64(0.05409593460444342), np.int64(30460): np.float64(0.045990178111682274), np.int64(30500): np.float64(0.04219647935746678), np.int64(30620): np.float64(0.04560841732831322), np.int64(30700): np.float64(0.03388031343037087), np.int64(30780): np.float64(0.04283538259961685), np.int64(30860): np.float64(0.04454696825859379), np.int64(30980): np.float64(0.042546079473275156), np.int64(31020): np.float64(0.09755731815367338), np.int64(31084): np.float64(0.07027389500166861), np.int64(31140): np.float64(0.028050007603332414), np.int64(31180): np.float64(0.059633236283461594), np.int64(31340): np.float64(0.03040002606240879), np.int64(31420): np.float64(0.058813781050196454), np.int64(31540): np.float64(0.0429255507440298), np.int64(31700): np.float64(0.04705058443430114), np.int64(31740): np.float64(0.049933064347157406), np.int64(31860): np.float64(0.03737244991735698), np.int64(31900): np.float64(0.047127809703359266), np.int64(31924): np.float64(0.03596069481795647), np.int64(32580): np.float64(0.06598154079839387), np.int64(32780): np.float64(0.06211436342198421), np.int64(32820): np.float64(0.06654795704343282), np.int64(32900): np.float64(0.0995429954696527), np.int64(33124): np.float64(0.07037834843184444), np.int64(33140): np.float64(0.04724561592833174), np.int64(33220): np.float64(0.039131025736813464), np.int64(33260): np.float64(0.05229766700714726), np.int64(33340): np.float64(0.034385795330450185), np.int64(33460): np.float64(0.046561050670146896), np.int64(33500): np.float64(0.04580939603857718), np.int64(33540): np.float64(0.052635410596974054), np.int64(33660): np.float64(0.05928393422044516), np.int64(33700): np.float64(0.07839615940751991), np.int64(33740): np.float64(0.035135421406001247), np.int64(33780): np.float64(0.05114126546969214), np.int64(33860): np.float64(0.03021974917912584), np.int64(33874): np.float64(0.035514596195813625), np.int64(34060): np.float64(0.046837219233457336), np.int64(34100): np.float64(0.04064434388217713), np.int64(34580): np.float64(0.06200012385016451), np.int64(34620): np.float64(0.04651647727342443), np.int64(34740): np.float64(0.041240053582212534), np.int64(34820): np.float64(0.04888706804713197), np.int64(34900): np.float64(0.06028329880002984), np.int64(34940): np.float64(0.06798303112390836), np.int64(34980): np.float64(0.0551399718634045), np.int64(35004): np.float64(0.04376755692956436), np.int64(35084): np.float64(0.043693850823319995), np.int64(35300): np.float64(0.05394609726694415), np.int64(35380): np.float64(0.0411965234688192), np.int64(35614): np.float64(0.04324661518188768), np.int64(35660): np.float64(0.0572733898308844), np.int64(35840): np.float64(0.07886638852775792), np.int64(35980): np.float64(0.04488282163673709), np.int64(36084): np.float64(0.05926065199662496), np.int64(36100): np.float64(0.06070217944241166), np.int64(36220): np.float64(0.06861962320181592), np.int64(36260): np.float64(0.05555026433591817), np.int64(36420): np.float64(0.03945482366387952), np.int64(36500): np.float64(0.07471957618948957), np.int64(36540): np.float64(0.04444698365897751), np.int64(36740): np.float64(0.06028836090157748), np.int64(36780): np.float64(0.03186775029636225), np.int64(36980): np.float64(0.04549073527507401), np.int64(37100): np.float64(0.0827338634840262), np.int64(37140): np.float64(0.03635799436336543), np.int64(37340): np.float64(0.0806514738633165), np.int64(37460): np.float64(0.060777379820798144), np.int64(37620): np.float64(0.07108664416061132), np.int64(37860): np.float64(0.04729164106563104), np.int64(37900): np.float64(0.06685306130021715), np.int64(37964): np.float64(0.03460707933323574), np.int64(38060): np.float64(0.06159405963855246), np.int64(38240): np.float64(0.04943028441177719), np.int64(38300): np.float64(0.03591891169602425), np.int64(38340): np.float64(0.05851955881187848), np.int64(38540): np.float64(0.04334199836122326), np.int64(38860): np.float64(0.0416691721308319), np.int64(38900): np.float64(0.06730773381999335), np.int64(38940): np.float64(0.07980556671488263), np.int64(39150): np.float64(0.05085189275563819), np.int64(39300): np.float64(0.04875723907561709), np.int64(39340): np.float64(0.04772539216240026), np.int64(39380): np.float64(0.06753358538124501), np.int64(39460): np.float64(0.06645819493861198), np.int64(39540): np.float64(0.05689642566108884), np.int64(39580): np.float64(0.038718730096236324), np.int64(39660): np.float64(0.03448772403399145), np.int64(39740): np.float64(0.059882140756831896), np.int64(39820): np.float64(0.053533213648777764), np.int64(39900): np.float64(0.05964904290982522), np.int64(40060): np.float64(0.03537018843143699), np.int64(40140): np.float64(0.06438897924073166), np.int64(40220): np.float64(0.06382023749824592), np.int64(40340): np.float64(0.035601007174131324), np.int64(40380): np.float64(0.039960529145141754), np.int64(40420): np.float64(0.05089573475022289), np.int64(40484): np.float64(0.04339543711682073), np.int64(40580): np.float64(0.04902324903128749), np.int64(40660): np.float64(0.05682828139543459), np.int64(40900): np.float64(0.06356025994846674), np.int64(40980): np.float64(0.043452929474396745), np.int64(41060): np.float64(0.03760524634026926), np.int64(41100): np.float64(0.06399194329984127), np.int64(41140): np.float64(0.04380299098026857), np.int64(41180): np.float64(0.06064047700177762), np.int64(41304): np.float64(0.05541891611342682), np.int64(41420): np.float64(0.0505207058283428), np.int64(41500): np.float64(0.06764159502413887), np.int64(41540): np.float64(0.054853743065642245), np.int64(41620): np.float64(0.04518305185219966), np.int64(41660): np.float64(0.05052884927034608), np.int64(41700): np.float64(0.056655427559948644), np.int64(41740): np.float64(0.06149993279924314), np.int64(41780): np.float64(0.04275412738024413), np.int64(41884): np.float64(0.05506431896564878), np.int64(41940): np.float64(0.0560257563612957), np.int64(42020): np.float64(0.08095542884025883), np.int64(42034): np.float64(0.07428553375581956), np.int64(42100): np.float64(0.05882662531271957), np.int64(42140): np.float64(0.047180816301597386), np.int64(42200): np.float64(0.06671088022287767), np.int64(42220): np.float64(0.06203202441604283), np.int64(42340): np.float64(0.06199977099328381), np.int64(42540): np.float64(0.05054365671498425), np.int64(42644): np.float64(0.06592141023316823), np.int64(42680): np.float64(0.07285179998375245), np.int64(42700): np.float64(0.08484254748519629), np.int64(43100): np.float64(0.0375141601022187), np.int64(43300): np.float64(0.06119532771727953), np.int64(43340): np.float64(0.03140537172900369), np.int64(43420): np.float64(0.04815840546264922), np.int64(43580): np.float64(0.04282392201149276), np.int64(43620): np.float64(0.0357251488399766), np.int64(43640): np.float64(0.041427371372426976), np.int64(43780): np.float64(0.06592031782723642), np.int64(43900): np.float64(0.03741566151087299), np.int64(44060): np.float64(0.057727984666114854), np.int64(44100): np.float64(0.023772079578408805), np.int64(44140): np.float64(0.05077072472156094), np.int64(44180): np.float64(0.030973334605671147), np.int64(44220): np.float64(0.05726542065805094), np.int64(44300): np.float64(0.03767417411926344), np.int64(44420): np.float64(0.04792392415847672), np.int64(44700): np.float64(0.06903402608155201), np.int64(44940): np.float64(0.05887613943379857), np.int64(45060): np.float64(0.03989396270071473), np.int64(45104): np.float64(0.04700421315994166), np.int64(45220): np.float64(0.05069788406576241), np.int64(45294): np.float64(0.05311288920063604), np.int64(45460): np.float64(0.0452668501158454), np.int64(45500): np.float64(0.043686643515745444), np.int64(45780): np.float64(0.0403138523592168), np.int64(45820): np.float64(0.03768142655325048), np.int64(45900): np.float64(0.03902393485273452), np.int64(45940): np.float64(0.04981036741473837), np.int64(46060): np.float64(0.0811277413842597), np.int64(46140): np.float64(0.03637686759601346), np.int64(46220): np.float64(0.03129584583485329), np.int64(46300): np.float64(0.048338183025211645), np.int64(46340): np.float64(0.04297127369201524), np.int64(46520): np.float64(0.19441301158944266), np.int64(46540): np.float64(0.050871593415838), np.int64(46660): np.float64(0.05793874355526861), np.int64(46700): np.float64(0.06869374981027696), np.int64(47020): np.float64(0.05573640257830546), np.int64(47220): np.float64(0.05700175551318592), np.int64(47260): np.float64(0.0375693259079555), np.int64(47300): np.float64(0.0693046026037312), np.int64(47380): np.float64(0.04153904236011397), np.int64(47460): np.float64(0.05194173759843849), np.int64(47580): np.float64(0.03691950493126781), np.int64(47664): np.float64(0.043447508003605084), np.int64(47764): np.float64(0.06717478675472831), np.int64(47930): np.float64(0.051752751671981186), np.int64(47940): np.float64(0.05976137356069346), np.int64(48060): np.float64(0.08470244762196985), np.int64(48140): np.float64(0.036175386307645094), np.int64(48260): np.float64(0.06335620298269504), np.int64(48300): np.float64(0.05272790445253515), np.int64(48424): np.float64(0.06479433432551311), np.int64(48540): np.float64(0.05388884722932296), np.int64(48620): np.float64(0.03429843240518567), np.int64(48660): np.float64(0.04728649393547519), np.int64(48680): np.float64(0.0465354845

In [24]:
df2 = pd.DataFrame(list(results.items()), columns=["key", "value"])

In [25]:
df2.head()

     key     value
0  10180  0.063769
1  10420  0.042533
2  10500  0.042710
3  10540  0.059973
4  10580  0.052775

In [26]:
df2['key'].value_counts()

key
49740    1
10180    1
10420    1
10500    1
10540    1
        ..
11460    1
11260    1
11244    1
11200    1
11180    1
Name: count, Length: 410, dtype: int64

In [27]:
df2 = df2.rename(columns={'key': 'MSA Code', 'value': 'HPI Volatility'})
df2['MSA Code'] = df2['MSA Code'].astype(str).str.strip()

In [28]:
df2

    MSA Code  HPI Volatility
0      10180        0.063769
1      10420        0.042533
2      10500        0.042710
3      10540        0.059973
4      10580        0.052775
..       ...             ...
405    49420        0.042235
406    49620        0.033496
407    49660        0.032928
408    49700        0.063023
409    49740        0.056883

[410 rows x 2 columns]

In [29]:
df3 = pd.read_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv")
df3['MSA Code'] = df3['MSA Code'].astype(str).str.strip()

In [30]:
merged = df3.merge(df2, on='MSA Code', how='left')

In [31]:
merged

    MSA Code               MSA Name  FIPS State Code  HPI Volatility
0      10180            Abilene, TX               48        0.063769
1      10380          Aguadilla, PR               72             NaN
2      10420              Akron, OH               39        0.042533
3      10500             Albany, GA               13        0.042710
4      10540             Albany, OR               41        0.059973
..       ...                    ...              ...             ...
388    49420             Yakima, WA               53        0.042235
389    49620       York Hanover, PA               42        0.033496
390    49660  Youngstown Warren, OH               39        0.032928
391    49700          Yuba City, CA                6        0.063023
392    49740               Yuma, AZ                4        0.056883

[393 rows x 4 columns]

In [32]:
merged.to_csv(r"C:\Users\samvi\Documents\Coding Projects\Embedded Work\Data\MSA Master Sheet.csv", index=False)

In [15]:
merged = df2.merge(df3, on='MSA Code', how='outer', indicator=True)

# Get rows that didn't match from either df1 or df2
unmatched = merged[merged['_merge'] != 'both']

# Optionally, split them
unmatched_df2 = merged[merged['_merge'] == 'left_only']
unmatched_df3 = merged[merged['_merge'] == 'right_only']

In [16]:
unmatched_df2

    MSA Code  HPI Volatility MSA Name  FIPS State Code     _merge
13     11244        0.063479      NaN              NaN  left_only
19     11694        0.053540      NaN              NaN  left_only
22     12054        0.037782      NaN              NaN  left_only
47     14454        0.047143      NaN              NaN  left_only
59     15764        0.045638      NaN              NaN  left_only
60     15804        0.048391      NaN              NaN  left_only
76     16984        0.044644      NaN              NaN  left_only
94     19124        0.054950      NaN              NaN  left_only
104    19804        0.048693      NaN              NaN  left_only
114    20994        0.094699      NaN              NaN  left_only
123    21794        0.056652      NaN              NaN  left_only
135    22744        0.110589      NaN              NaN  left_only
138    23104        0.049137      NaN              NaN  left_only
139    23224        0.046774      NaN              NaN  left_only
208    29404        0.046351      NaN              NaN  left_only
209    29414        0.036003      NaN              NaN  left_only
212    29484        0.043815      NaN              NaN  left_only
232    31084        0.070274      NaN              NaN  left_only
242    31924        0.035961      NaN              NaN  left_only
249    33124        0.070378      NaN              NaN  left_only
262    33874        0.035515      NaN              NaN  left_only
272    35004        0.043768      NaN              NaN  left_only
273    35084        0.043694      NaN              NaN  left_only
276    35614        0.043247      NaN              NaN  left_only
281    36084        0.059261      NaN              NaN  left_only
298    37964        0.034607      NaN              NaN  left_only
326    40484        0.043395      NaN              NaN  left_only
335    41304        0.055419      NaN              NaN  left_only
345    41884        0.055064      NaN              NaN  left_only
349    42034        0.074286      NaN              NaN  left_only
356    42644        0.065921      NaN              NaN  left_only
379    45104        0.047004      NaN              NaN  left_only
381    45294        0.053113      NaN              NaN  left_only
405    47664        0.043448      NaN              NaN  left_only
406    47764        0.067175      NaN              NaN  left_only
414    48424        0.064794      NaN              NaN  left_only
420    48864        0.038652      NaN              NaN  left_only

In [17]:
unmatched_df3

,MSA Code,HPI Volatility,MSA Name,FIPS State Code,_merge
1,10380,NaN,"Aguadilla, PR",72.0,right_only
18,11640,NaN,"Arecibo, PR",72.0,right_only
23,12060,NaN,"Atlanta Sandy Springs Roswell, GA",13.0,right_only
48,14460,NaN,"Boston Cambridge Newton, MA NH",25.0,right_only
75,16980,NaN,"Chicago Naperville Elgin, IL IN",17.0,right_only
93,19100,NaN,"Dallas Fort Worth Arlington, TX",48.0,right_only
105,19820,NaN,"Detroit Warren Dearborn, MI",26.0,right_only
111,20580,NaN,"Eagle Pass, TX",48.0,right_only
158,25020,NaN,"Guayama, PR",72.0,right_only
231,31080,NaN,"Los Angeles Long Beach Anaheim, CA",6.0,right_only
243,32420,NaN,"Mayagüez, PR",72.0,right_only
248,33100,NaN,"Miami Fort Lauderdale West Palm Beach, FL",12.0,right_only
277,35620,NaN,"New York Newark Jersey City, NY NJ",34.0,right_only
299,37980,NaN,"Philadelphia Camden Wilmington, PA NJ DE MD",10.0,right_only
305,38660,NaN,"Ponce, PR",72.0,right_only
344,41860,NaN,"San Francisco Oakland Fremont, CA",6.0,right_only
347,41980,NaN,"San Juan Bayamón Caguas, PR",72.0,right_only
357,42660,NaN,"Seattle Tacoma Bellevue, WA",53.0,right_only
382,45300,NaN,"Tampa St. Petersburg Clearwater, FL",12.0,right_only
407,47900,NaN,"Washington Arlington Alexandria, DC VA MD WV",11.0,right_only

In [21]:
merged_df = pd.merge(df3, df2, on='MSA Code', how='inner', indicator=True)

unmatched = merged_df[merged_df['_merge'] == 'left_only']

In [22]:
unmatched

Empty DataFrame
Columns: [MSA Code, MSA Name, FIPS State Code, HPI Volatility, _merge]
Index: []